'''Два различных натуральных числа n и m называются дружественными, 
если сумма делителей числа n (включая 1, но исключая само n) равна числу m и наоборот. 
Например, 220 и 284 – дружественные числа. По данному числу k выведите все пары дружественных чисел, 
каждое из которых не превосходит k. Программа получает на вход одно натуральное число k, 
не превосходящее 105. Программа должна вывести все пары дружественных чисел, 
каждое из которых не превосходит k. Пары необходимо выводить по одной в строке, разделяя пробелами. 
Каждая пара должна быть выведена только один раз (перестановка чисел новую пару не дает).
Ввод:      Вывод:
300        220 284'''

def sym_del(n):
    summa = 0
    for i in range(1, int(n**0.5+1)):
        if n % i == 0:
            summa += i + n//i
    return summa - n

def main():
    k = int(input("Введите число К: "))
    uniq = []
    for fnum in range(1, k+1):
        if fnum not in uniq :
            snum = sym_del(fnum)
            if sym_del(snum) == fnum and fnum!=snum:
                print(fnum, snum)
                uniq.append(snum)

if __name__ == "__main__":
    main()